var dom = document.getElementById("barneg");
            var myChart = echarts.init(dom);
            var app = {};        
            var option;
            option = {
                tooltip: {
                    trigger: 'axis',
                    axisPointer: {            // 坐标轴指示器，坐标轴触发有效
                        type: 'shadow'        // 默认为直线，可选为：'line' | 'shadow'
                    }
                },
                legend: {
                    data: ['净增加', '离开食堂', '进入食堂']
                },
                grid: {
                    left: '3%',
                    right: '4%',
                    bottom: '3%',
                    containLabel: true
                },
                xAxis: [
                    {
                        type: 'value'
                    }
                ],
                yAxis: [
                    {
                        type: 'category',
                        axisTick: {
                            show: false
                        },
                        data: [
                        '11:43','11:44','11:45','11:46','11:47','11:48','11:49','11:50','11:51','11:52','11:53','11:54','11:55','11:56','11:57','11:58','11:59','12:00','12:01','12:02','12:03','12:04','12:05','12:06','12:07','12:08','12:09','12:10','12:11','12:12','12:13','12:14','12:15','12:16','12:17','12:18','12:19','12:20','12:21','12:22','12:23','12:24','12:25','12:26','12:27','12:28','12:29','12:30','12:31','12:32','12:33','12:34','12:35','12:36','12:37','12:38','12:39','12:40','12:41','12:42','12:43','12:44','12:45','12:46','12:47','12:48','12:49'
                        ]
                    }
                ],
                dataZoom: [
                            {        
                                id: 'dataZoomY',  
                                yAxisIndex:0,      
                                show:true,                              //是否显示 组件。如果设置为 false，不会显示，但是数据过滤的功能还存在。        
                                backgroundColor:"rgba(47,69,84,0)",  //组件的背景颜色        
                                type: 'slider',                         //slider表示有滑动块的，inside表示内置的 
                                handleIcon: 'M10.7,11.9H9.3c-4.9,0.3-8.8,4.4-8.8,9.4c0,5,3.9,9.1,8.8,9.4h1.3c4.9-0.3,8.8-4.4,8.8-9.4C19.5,16.3,15.6,12.2,10.7,11.9z M13.3,24.4H6.7V23h6.6V24.4z M13.3,19.6H6.7v-1.4h6.6V19.6z',
                                handleSize: '105%'       
                               }
                           
                        ],
                series: [
                    {
                        name: '净增加',
                        type: 'bar',
                        label: {
                            show: true,
                            position: 'inside'
                        },
                        emphasis: {
                            focus: 'series'
                        },
                        data: [
                        8,13,6,0,-7,1,-9,-1,-9,12,-2,14,-4,-5,-2,1,0,9,6,-10,6,6,-5,4,-11,-3,-1,-8,0,5,-4,-10,8,0,3,2,-14,4,-2,-8,-11,0,-6,-1,-8,-2,-2,2,-15,-4,2,-10,-2,5,-1,-3,-5,-7,-8,-4,3,-2,-18,-17,-1,-7,-5
                        ]
                    },
                    {
                        name: '进入食堂',
                        type: 'bar',
                        stack: '总量',
                        label: {
                            show: true
                        },
                        emphasis: {
                            focus: 'series',
                            position:'right'
                        },
                        data: [
                        15,20,22,12,16,20,11,15,5,20,11,18,14,15,10,12,8,17,18,12,17,16,10,12,11,13,4,10,11,15,17,5,22,12,12,15,3,8,12,11,11,14,14,8,7,8,13,10,5,12,12,3,12,7,12,10,8,8,5,8,10,8,5,7,6,4,4
                        ]
                    },
                    {
                        name: '离开食堂',
                        type: 'bar',
                        stack: '总量',
                        label: {
                            show: true,
                            position: 'left'
                        },
                        emphasis: {
                            focus: 'series'
                        },
                        data: [
                        -7,-7,-16,-12,-23,-19,-20,-16,-14,-8,-13,-6,-20,-20,-12,-14,-8,-8,-13,-22,-11,-12,-15,-8,-24,-17,-5,-19,-11,-12,-22,-15,-16,-12,-10,-13,-17,-4,-14,-20,-25,-14,-21,-11,-15,-10,-18,-8,-20,-17,-11,-13,-14,-8,-13,-13,-13,-19,-14,-13,-8,-14,-23,-24,-9,-14,-10    
                        ]
                    }
                ]
            };
            
            if (option && typeof option === 'object') {
                myChart.setOption(option);
            }
            